artillery-auth-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 10
      arrivalRate: 15  # 15 users per second for 10 seconds = 150 users
  defaults:
    headers:
      Content-Type: 'application/json'
      'x-test-mode': 'true'  # Bypass rate limiting for load testing
  processor: "./artillery-helpers.js"

scenarios:
  - name: "Auth Load Test"
    weight: 100
    flow:
      - function: "setUserId"
      - post:
          url: "/api/v1/auth/register"
          json:
            fullName: "Test User {{ userId }}"
            email: "test{{ userId }}@example.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1  # Wait 1 second between requests
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "test{{ userId }}@example.com"
            password: "password123"